In [1]:
import pandas as pd
import numpy as np

In [2]:
data= {
    "Name":['Anshu','Harsh','Ginni'],
    "Roll_no.": [6,16,17],
    "Location": ['Nangloi','peeragadhi','Narela']
}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

    Name  Roll_no.    Location
0  Anshu         6     Nangloi
1  Harsh        16  peeragadhi
2  Ginni        17      Narela

In [5]:
new= pd.Series(['Duggu',20,'paschim vihar'],index=['Name','Roll_no.','Location'])
df=df.append(new,ignore_index=True)

In [6]:
df

    Name  Roll_no.       Location
0  Anshu         6        Nangloi
1  Harsh        16     peeragadhi
2  Ginni        17         Narela
3  Duggu        20  paschim vihar

In [7]:
df=df.set_index("Name")

In [8]:
df

       Roll_no.       Location
Name
Anshu         6        Nangloi
Harsh        16     peeragadhi
Ginni        17         Narela
Duggu        20  paschim vihar

In [9]:
df[df["Roll_no."]>=16].count

<bound method DataFrame.count of        Roll_no.       Location
Name
Harsh        16     peeragadhi
Ginni        17         Narela
Duggu        20  paschim vihar>

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Anshu to Duggu
Data columns (total 2 columns):
Roll_no.    4 non-null int64
Location    4 non-null object
dtypes: int64(1), object(1)
memory usage: 96.0+ bytes

In [11]:
df.describe()

        Roll_no.
count   4.000000
mean   14.750000
std     6.075909
min     6.000000
25%    13.500000
50%    16.500000
75%    17.750000
max    20.000000

In [12]:
df.shape

(4, 2)

In [13]:
df.size

8

In [14]:
df.iloc[2]

Roll_no.        17
Location    Narela
Name: Ginni, dtype: object

In [15]:
df.iloc[2][1]

'Narela'

In [16]:
df.iloc[0:2]

       Roll_no.    Location
Name
Anshu         6     Nangloi
Harsh        16  peeragadhi

In [21]:
df.iloc[:,1].values

array(['Nangloi', 'peeragadhi', 'Narela', 'paschim vihar'], dtype=object)

In [25]:
df.loc["Anshu"]

Roll_no.          6
Location    Nangloi
Name: Anshu, dtype: object

In [26]:
df.Location.replace("Nangloi","Narela")

Name
Anshu           Narela
Harsh       peeragadhi
Ginni           Narela
Duggu    paschim vihar
Name: Location, dtype: object

In [27]:
df.rename(columns={"Location":"Locality"})

       Roll_no.       Locality
Name
Anshu         6        Nangloi
Harsh        16     peeragadhi
Ginni        17         Narela
Duggu        20  paschim vihar

In [29]:
df["Roll_no."].min()

6

In [30]:
df["Roll_no."].max()

20

In [31]:
df["Roll_no."].mean()

14.75

In [32]:
df["Roll_no."].count()

4

In [33]:
df["Roll_no."].unique()

array([ 6, 16, 17, 20], dtype=int64)

In [37]:
#df["Roll_no."].count_values()